//
//  PersonaCodeCodes.swift
//  Persona Code
//
//  Created by Иван Семикин on 23/02/2025.
//

import Foundation

struct PersonaCodeCodes {
    static let allCodes: CodeDictionary = [
        // MARK: - 1 Код
        1: CodeInfo(
            codeNumber: 1,
            title: "1. Код Личности (1 Код)",
            subcategories: [
                Subcategory(
                    title: "Значение кода",
                    shortDescription: "Ваши ключевые характеристики и особенности личности.",
                    mainDescription: """
                    Ваш Код Личности — 1. Этот Код символизирует начало, лидерство и силу индивидуальности. Люди с этим числом обладают мощной энергией, стремлением к независимости и внутренней уверенностью. Они нередко становятся пионерами в своих областях, инициируют проекты и проявляют решимость в достижении целей.

                    Такие люди обладают природным талантом к лидерству и стремятся к самостоятельности. Они не боятся брать на себя ответственность и способны вдохновлять окружающих. Их активность, инициативность и харизма помогают им преодолевать трудности и двигаться вперёд.

                    Однако чрезмерное стремление к лидерству может сделать их слишком властными или упрямыми. Баланс между уверенностью в себе и способностью учитывать мнение других людей играет ключевую роль в развитии гармоничной личности.
                    """
                ),
                Subcategory(
                    title: "Влияние на характер",
                    shortDescription: "Как заложенные качества формируют поведение.",
                    mainDescription: """
                    Люди с 1 Кодом обладают сильным внутренним стержнем и стремлением к автономии. Они уверены в своих решениях и редко поддаются сомнениям. Такие личности привыкли полагаться на себя и предпочитают действовать самостоятельно, даже если это означает преодоление сложностей.

                    Они часто становятся инициаторами перемен, обладают высокой работоспособностью и способны мотивировать других. Однако их склонность к самостоятельности может привести к трудностям в коммуникации, если они не развивают навыки взаимодействия и сотрудничества.

                    Для них важно научиться слушать окружающих и учитывать их мнение. Это поможет избежать конфликтов и сделать их путь к успеху более гармоничным.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                    mainDescription: """
                    - Развивайте навыки сотрудничества: Учитесь учитывать точку зрения других людей.
                    - Будьте терпеливыми: Не торопите события и дайте окружающим время адаптироваться к вашим решениям.
                    - Работайте над эмоциональным интеллектом: Открытость и эмпатия помогут наладить более глубокие взаимоотношения.
                    - Находите баланс между лидерством и доверием к другим: Не бойтесь делегировать и принимать помощь.
                    - Уделяйте внимание отдыху: Высокая активность требует восстановления, чтобы сохранять продуктивность.

                    Следуя этим рекомендациям, вы сможете гармонично реализовать свой потенциал, развивая лучшие качества 1 Кода.
                    """
                )
            ]
        ),
        // MARK: - 2 Код
        2: CodeInfo(
            codeNumber: 2,
            title: "1. Код Личности (2 Код)",
            subcategories: [
                Subcategory(
                    title: "Значение кода",
                    shortDescription: "Ваши ключевые характеристики и особенности личности.",
                    mainDescription: """
                    Ваш Код Личности — 2. Это символ гармонии, баланса и умения находить компромиссы. Люди с этим Кодом обладают природной дипломатичностью и интуицией, что делает их отличными посредниками в разрешении конфликтов. Они стремятся создавать стабильность вокруг себя и помогают другим чувствовать себя комфортно.

                    Эти люди ценят сотрудничество и умеют поддерживать гармоничные отношения. Они обладают чуткостью и способны понимать чувства окружающих, что делает их ценными друзьями, партнёрами и советчиками.

                    Однако стремление избегать конфликтов может привести к подавлению собственных желаний. Важно развивать уверенность в себе и учиться выражать свои потребности, чтобы сохранять баланс между заботой о других и собственными интересами.
                    """
                ),
                Subcategory(
                    title: "Влияние на характер",
                    shortDescription: "Как заложенные качества формируют поведение.",
                    mainDescription: """
                    Люди с 2 Кодом отличаются мягкостью, чуткостью и эмпатией. Они умеют подстраиваться под обстоятельства, легко находят общий язык с разными людьми и часто играют роль миротворцев.

                    Их эмоциональная отзывчивость делает их ценными членами коллектива, но также может приводить к тревожности и неуверенности. Иногда они слишком сильно зависят от одобрения окружающих и боятся разочаровать других.

                    Для гармоничного развития личности важно научиться доверять себе и своим решениям. Развивая самооценку и умение отстаивать личные границы, они могут достигать своих целей, оставаясь верными своим принципам.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                    mainDescription: """
                    - Учитесь выражать свои желания: Не бойтесь быть услышанным.
                    - Заботьтесь о своих границах: Помните, что ваше мнение важно.
                    - Развивайте уверенность в себе: Укрепляйте самооценку через достижение личных целей.
                    - Ставьте личные приоритеты: Уделяйте время тому, что приносит радость.
                    - Практикуйте методы релаксации: Поддерживайте эмоциональное здоровье.

                    Следуя этим рекомендациям, вы сможете найти баланс между заботой о себе и поддержанием гармоничных отношений с окружающими.
                    """
                )
            ]
        ),
        // MARK: - 3 Код
        3: CodeInfo(
            codeNumber: 3,
            title: "1. Код Личности (3 Код)",
            subcategories: [
                Subcategory(
                    title: "Значение кода",
                    shortDescription: "Ваши ключевые характеристики и особенности личности.",
                    mainDescription: """
                    Ваш Код Личности — 3. Он символизирует творчество, радость и общительность. Люди с этим Кодом обладают яркой индивидуальностью, стремлением к самовыражению и природным оптимизмом. Их энтузиазм вдохновляет окружающих, делая их харизматичными лидерами и душой компании.

                    Они часто обладают талантом в искусстве, литературе или других творческих сферах. Их способность видеть красоту в деталях и находить радость в жизни помогает преодолевать трудности и мотивировать других. Они легко адаптируются к изменениям и быстро осваивают новые навыки.

                    Однако склонность к поверхностному отношению и избеганию рутинных задач может мешать достижению долгосрочных целей. Важно развивать дисциплину и учиться фокусироваться на значимых проектах, чтобы реализовать свой потенциал.
                    """
                ),
                Subcategory(
                    title: "Влияние на характер",
                    shortDescription: "Как заложенные качества формируют поведение.",
                    mainDescription: """
                    Люди с 3 Кодом отличаются оптимизмом, лёгкостью в общении и творческим подходом к жизни. Они любят быть в центре внимания, а их чувство юмора и харизма привлекают к ним окружающих. Они обладают способностью вдохновлять и поднимать настроение.

                    Однако иногда их излишняя жизнерадостность может восприниматься как несерьёзность. Они могут уклоняться от ответственности и бояться обязательств, предпочитая свободу действий.

                    Развивая чувство ответственности и умение планировать, они могут достичь большего успеха как в личной, так и в профессиональной жизни.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                    mainDescription: """
                    - Развивайте самодисциплину: Учитесь доводить начатое до конца.
                    - Найдите баланс между работой и отдыхом: Не забывайте о долгосрочных целях.
                    - Углубляйте знания: Расширяйте навыки в интересующих вас областях.
                    - Управляйте временем: Составляйте чёткий план на день.
                    - Заботьтесь о своей энергии: Избегайте переутомления и эмоционального выгорания.

                    Следуя этим рекомендациям, вы сможете раскрыть свои таланты и достичь гармонии в жизни.
                    """
                )
            ]
        ),
        // MARK: - 4 Код
         4: CodeInfo(
             codeNumber: 4,
             title: "1. Код Личности (4 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 4. Он символизирует стабильность, дисциплину и упорство. Люди с этим Кодом обладают сильным чувством ответственности, трудолюбием и способностью к планированию. Они стремятся создавать надежную основу для своей жизни, уделяя внимание деталям и последовательности в действиях.

                     Такие люди отлично подходят для работы, требующей терпения и сосредоточенности. Их прагматизм позволяет им принимать взвешенные решения, которые обеспечивают устойчивость в долгосрочной перспективе. Они предпочитают организованный подход и избегают лишних рисков.

                     Однако склонность к излишней строгости и консервативности может ограничивать их возможности. Им важно учиться принимать изменения и оставаться открытыми для новых идей, чтобы не упустить перспективы роста и развития.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 4 Кодом проявляют решительность, настойчивость и преданность своим целям. Они любят порядок, ценят стабильность и всегда стремятся выполнять свои обязанности на высшем уровне. Их надежность делает их важными членами любого коллектива или семьи.

                     Однако их строгость к себе и другим может вызывать трудности в общении. Иногда они могут казаться чересчур критичными или жесткими, что создает напряжение в отношениях. Им полезно развивать гибкость и терпимость, чтобы лучше взаимодействовать с окружающими.

                     В то же время их преданность и усердие делают их успешными в достижении своих целей, если они сохраняют баланс между дисциплиной и открытостью.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Развивайте гибкость: Будьте открыты для новых идей и перспектив.
                     - Балансируйте работу и отдых: Найдите время для расслабления и восстановления энергии.
                     - Практикуйте терпимость: Старайтесь понимать других и не быть слишком строгими.
                     - Учитесь принимать изменения: Примите, что перемены могут быть полезными.
                     - Ставьте долгосрочные цели: Постепенно добивайтесь их с помощью последовательных действий.

                     Следуя этим рекомендациям, вы сможете сохранять стабильность и гармонию в жизни, не теряя открытости для новых возможностей.
                     """
                 )
             ]
         ),
        // MARK: - 5 Код
         5: CodeInfo(
             codeNumber: 5,
             title: "1. Код Личности (5 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 5. Он символизирует свободу, приключения и перемены. Люди с этим Кодом обладают жаждой нового опыта и стремлением к исследованию мира. Они любят динамику и перемены, что помогает им адаптироваться к новым обстоятельствам и находить нестандартные решения.

                     Такие люди обладают острым умом и способны быстро обучаться, что делает их успешными в разнообразных сферах. Они не боятся рисковать и готовы к экспериментам, которые открывают новые горизонты.

                     Однако их склонность к импульсивности может привести к недальновидным решениям. Им важно развивать ответственность и умение планировать, чтобы их жизнь была более стабильной и сбалансированной.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 5 Кодом часто проявляют независимость, открытость к новым возможностям и энергию. Они обожают свободу и не терпят ограничений, стремясь к самовыражению и независимости в своих действиях. Их жизнерадостность вдохновляет окружающих и помогает находить общий язык в любой ситуации.

                     Однако их неспособность к рутине и склонность к спонтанности могут мешать им достигать долгосрочных целей. Иногда они могут избегать обязательств, предпочитая легкость и гибкость.

                     Для достижения успеха им важно учиться сочетать свою страсть к приключениям с ответственностью за свои решения и действия.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Развивайте самодисциплину: Учитесь доводить начатое до конца.
                     - Планируйте свой день: Найдите баланс между спонтанностью и структурой.
                     - Избегайте излишней импульсивности: Обдумывайте свои действия перед принятием решений.
                     - Уделяйте внимание отношениям: Старайтесь строить стабильные и надежные связи.
                     - Заботьтесь о здоровье: Регулярно отдыхайте и находите время для восстановления энергии.

                     Следуя этим рекомендациям, вы сможете сохранить свою уникальную свободу и при этом достичь устойчивого успеха в жизни.
                     """
                 )
             ]
         ),
        // MARK: - 6 Код
         6: CodeInfo(
             codeNumber: 6,
             title: "1. Код Личности (6 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 6. Он символизирует любовь, гармонию и ответственность. Люди с этим Кодом стремятся к созданию теплой и стабильной атмосферы. Их прирожденная эмпатия и желание заботиться о других делают их незаменимыми членами общества и семьи. Они направляют усилия на укрепление отношений, поддержание мира и создание баланса.

                     Эти люди всегда готовы поддержать близких и взять на себя ответственность за общее благо. Они прекрасно понимают потребности окружающих и прилагают максимум усилий для их удовлетворения. Их умение находить компромиссы и стремление к гармонии выделяют их среди других.

                     Однако излишняя самоотверженность может привести к тому, что они забывают о собственных нуждах. Им важно научиться говорить "нет" и уделять внимание собственному благополучию. Находя баланс между отдачей и принятием, они могут избежать эмоционального выгорания и сохранить гармонию.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 6 Кодом отличаются добротой, чуткостью и ответственностью. Они обладают природной способностью привносить гармонию в любые отношения, будь то дружба, работа или семья. Их щедрость и преданность делают их любимыми и уважаемыми среди окружающих.

                     Однако их стремление к идеалу иногда приводит к разочарованиям, особенно если их усилия остаются незамеченными. Они могут быть склонны к самокритике или ожидать от других слишком многого. Иногда они берут на себя больше обязательств, чем могут выполнить.

                     Развивая умение ценить свои достижения и не зависеть от одобрения окружающих, они могут достичь гармонии и укрепить свои отношения с другими.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Заботьтесь о своих потребностях: Учитесь уделять время личным интересам и отдыху.
                     - Устанавливайте границы: Не бойтесь говорить "нет", чтобы избежать перегрузок.
                     - Находите баланс: Уравновешивайте отдачу с возможностью получать помощь от других.
                     - Развивайте терпимость: Не ожидайте идеала от себя и окружающих.
                     - Практикуйте расслабление: Найдите время для медитации и восстановления энергии.

                     Эти советы помогут вам сохранить внутреннюю гармонию и построить здоровые отношения с окружающими.
                     """
                 )
             ]
         ),
        // MARK: - 7 Код
         7: CodeInfo(
             codeNumber: 7,
             title: "1. Код Личности (7 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 7. Это символ внутренней мудрости, аналитического мышления и духовного роста. Люди с этим Кодом обладают развитой интуицией и глубоким пониманием окружающего мира. Они склонны к самоанализу, ищут ответы на фундаментальные вопросы жизни и стремятся познать истину.

                     Они часто находят себя в науке, философии, искусстве или духовных практиках. Их способность видеть суть вещей и анализировать происходящее делает их выдающимися мыслителями. Им важно следовать своему внутреннему пути и не бояться быть непонятыми.

                     Однако их стремление к уединению и независимости может привести к социальной изоляции. Им важно развивать навыки общения и находить баланс между личными размышлениями и взаимодействием с окружающими.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 7 Кодом отличаются вдумчивостью, аналитическим складом ума и стремлением к самопознанию. Они обладают природной любознательностью и склонны глубоко изучать темы, которые их интересуют. Их мышление проницательное, и они способны замечать детали, ускользающие от других.

                     Однако их замкнутость и склонность к одиночеству могут затруднять выстраивание близких отношений. Они могут казаться слишком отстраненными или неприступными, что мешает наладить гармоничное общение.

                     Развивая навыки открытого общения и умение доверять людям, они смогут не только обогатить свою жизнь, но и стать ценными советниками и наставниками для других.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Развивайте навыки общения: Учитесь делиться своими мыслями и чувствами с окружающими.
                     - Используйте свою интуицию: Доверяйте своим внутренним ощущениям и предчувствиям.
                     - Найдите баланс между уединением и социальной жизнью: Общение помогает раскрыть новые перспективы.
                     - Будьте открыты к новому опыту: Иногда практика важнее теории.
                     - Развивайте эмоциональную гибкость: Учитесь принимать мир таким, какой он есть, без излишнего анализа.

                     Следуя этим советам, вы сможете реализовать свой интеллектуальный и духовный потенциал, оставаясь в гармонии с окружающим миром.
                     """
                 )
             ]
         ),
        // MARK: - 8 Код
         8: CodeInfo(
             codeNumber: 8,
             title: "1. Код Личности (8 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 8. Это символ силы, уверенности и стремления к успеху. Люди с этим Кодом обладают врожденным лидерством, умением принимать сложные решения и высокой работоспособностью. Они целеустремленны, организованы и способны преодолевать любые препятствия на пути к своим целям.

                     Они ориентированы на достижение результатов и умеют эффективно управлять как своими ресурсами, так и ресурсами окружающих. Их амбиции часто приводят их к высоким позициям в карьере, а настойчивость помогает реализовывать самые смелые проекты.

                     Однако их стремление контролировать всё вокруг может создавать напряжение в отношениях с другими. Им важно научиться находить баланс между лидерством и доверием, а также развивать эмпатию, чтобы сохранять гармонию в общении.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 8 Кодом отличаются решительностью, смелостью и организаторскими способностями. Они привыкли добиваться своего и редко сдаются перед трудностями. Их уверенность и сила воли делают их прирожденными лидерами, способными вдохновлять других.

                     Однако их потребность в контроле и высокие стандарты могут создавать сложности в общении. Они могут быть требовательными не только к себе, но и к окружающим, что иногда приводит к конфликтам или ощущению давления.

                     Развивая гибкость и умение слушать других, они могут улучшить взаимоотношения и создать более продуктивную и гармоничную среду как в работе, так и в личной жизни.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Учитесь делегировать: Доверяйте окружающим выполнение задач и не пытайтесь контролировать всё.
                     - Развивайте эмпатию: Будьте внимательны к эмоциям и потребностям людей.
                     - Находите баланс между работой и отдыхом: Не перегружайте себя чрезмерными обязательствами.
                     - Избегайте жесткости в общении: Практикуйте гибкость и компромисс.
                     - Используйте свою силу на благо: Направляйте свою энергию не только на личные цели, но и на помощь другим.

                     Следуя этим советам, вы сможете реализовать свой потенциал, сохраняя гармонию в жизни и взаимоотношениях.
                     """
                 )
             ]
         ),
        // MARK: - 9 Код
         9: CodeInfo(
             codeNumber: 9,
             title: "1. Код Личности (9 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 9. Это символ мудрости, духовного роста и стремления к высшим целям. Люди с этим Кодом обладают развитой интуицией, глубоким мышлением и стремлением понять мир во всей его сложности. Они часто становятся наставниками, учителями или вдохновителями для других.

                     Их внутренняя сила заключается в способности видеть скрытые смыслы и направлять людей на путь самопознания. Они обладают природной добротой и стремятся сделать мир лучше, оказывая поддержку тем, кто в этом нуждается.

                     Однако их идеализм может приводить к разочарованиям, если окружающая действительность не соответствует их высоким ожиданиям. Им важно учиться принимать несовершенство жизни и находить радость в процессе, а не только в конечном результате.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 9 Кодом отличаются высоким уровнем осознанности, стремлением к самопознанию и желанием делиться своими знаниями. Они обладают философским складом ума и глубоким пониманием человеческой природы. Их способность вдохновлять и поддерживать делает их важными фигурами в жизни окружающих.

                     Однако их склонность к размышлениям и поиску высшего смысла может отдалять их от повседневной жизни. Иногда они настолько погружаются в свои идеи, что теряют связь с реальностью или пренебрегают практическими аспектами жизни.

                     Развивая баланс между духовным поиском и реальными действиями, они могут достичь гармонии и использовать свой потенциал на благо себя и общества.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Укрепляйте связь с реальностью: Не забывайте о практических аспектах жизни.
                     - Развивайте терпимость: Принимайте несовершенства мира и людей.
                     - Уделяйте внимание личным границам: Не позволяйте эмоциональному перенапряжению истощать вас.
                     - Делитесь знаниями: Ваш опыт и мудрость могут помочь многим.
                     - Находите радость в настоящем: Учитесь ценить каждое мгновение, а не только конечный результат.

                     Следуя этим рекомендациям, вы сможете реализовать свой потенциал и обрести гармонию в жизни.
                     """
                 )
             ]
         ),
        // MARK: - 10 Код
         10: CodeInfo(
             codeNumber: 10,
             title: "1. Код Личности (10 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 10. Это символ перемен, удачи и жизненных циклов. Люди с этим Кодом обладают способностью легко адаптироваться к обстоятельствам и извлекать выгоду даже из самых сложных ситуаций. Они уверены в том, что судьба всегда ведёт их в нужном направлении, и умеют находить новые возможности там, где другие видят препятствия.

                     Они динамичны, энергичны и открыты к новому опыту. Их оптимизм помогает им преодолевать трудности и вдохновлять окружающих на смелые шаги. Однако их любовь к переменам может привести к нестабильности, если они не научатся держать баланс между спонтанностью и долгосрочным планированием.

                     Развивая способность к осознанному выбору и оценивая последствия своих действий, они могут добиться значительных успехов и создать крепкий фундамент для будущего.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 10 Кодом отличаются гибкостью, интуицией и умением быстро принимать решения. Они обладают природной харизмой и часто оказываются в центре внимания благодаря своей открытости и жизнерадостности. Их уверенность в себе и способность рисковать помогают им добиваться успеха.

                     Однако их тяга к новизне иногда мешает им сосредоточиться на одном направлении. Они могут легко терять интерес к проектам или отношениям, если не видят в них развития. Иногда они могут действовать слишком импульсивно, не продумывая последствия своих решений.

                     Развивая терпение и умение придерживаться выбранного курса, они смогут реализовать свой потенциал и достичь устойчивого успеха.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Учитесь завершать начатое: Развивайте самодисциплину и не бросайте проекты на полпути.
                     - Анализируйте свои решения: Прежде чем действовать, подумайте о долгосрочных последствиях.
                     - Найдите баланс: Развивайте стабильность в жизни, не теряя свою любовь к переменам.
                     - Поддерживайте доверительные отношения: Укрепляйте связи с близкими, чтобы не ощущать одиночества.
                     - Практикуйте осознанность: Учитесь замедляться и наслаждаться моментом.

                     Эти рекомендации помогут вам использовать свою динамичность и интуицию с максимальной пользой, создавая гармоничную и успешную жизнь.
                     """
                 )
             ]
         ),
        // MARK: - 11 Код
         11: CodeInfo(
             codeNumber: 11,
             title: "1. Код Личности (11 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 11. Это символ вдохновения, лидерства и духовной силы. Люди с этим Кодом обладают уникальной способностью влиять на окружающих, мотивировать их и вести за собой. Их энергия заряжает пространство, а нестандартное мышление помогает находить новые пути к успеху.

                     Они стремятся к самореализации, постоянно развиваются и часто становятся наставниками или учителями для других. Их внутренний потенциал позволяет им справляться с трудностями и преодолевать преграды, не теряя веру в себя.

                     Однако их сила может превратиться в упрямство, если они не научатся гибкости. Им важно развивать способность слушать других, чтобы не только вдохновлять, но и гармонично взаимодействовать с миром.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 11 Кодом обладают сильной волей, харизмой и стремлением к высоким целям. Они часто оказываются в центре внимания благодаря своему влиянию на окружающих. Их способность мотивировать делает их отличными лидерами, а стремление к совершенству побуждает их постоянно расти.

                     Однако их требовательность к себе и другим может вызывать напряжение. Они могут быть слишком настойчивыми в своих взглядах и не всегда готовы принять альтернативные точки зрения. Иногда их амбиции приводят к эмоциональному истощению.

                     Развивая умение доверять процессу и принимать изменения, они смогут сохранить внутреннюю гармонию и достигать больших результатов.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Развивайте терпение: Учитесь ждать результата и не спешить с решениями.
                     - Будьте открыты к мнению других: Гибкость поможет вам строить прочные отношения.
                     - Балансируйте работу и отдых: Не допускайте переутомления и эмоционального истощения.
                     - Используйте свою силу осознанно: Направляйте её на созидание и развитие.
                     - Практикуйте саморефлексию: Анализируйте свои действия и учитесь извлекать уроки.

                     Эти рекомендации помогут вам максимально раскрыть свой потенциал и создать гармоничную и успешную жизнь.
                     """
                 )
             ]
         ),
        // MARK: - 12 Код
         12: CodeInfo(
             codeNumber: 12,
             title: "1. Код Личности (12 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 12. Это символ осознания, самопознания и внутренней трансформации. Люди с этим Кодом обладают глубокой интуицией и способностью видеть мир шире, чем большинство. Они часто ощущают свою связь с высшими ценностями и стремятся к духовному развитию.

                     Они обладают уникальной способностью к анализу и саморефлексии, что делает их мудрыми и осознанными. Их сила в умении замечать скрытые аспекты жизни и понимать причинно-следственные связи. Они могут быть наставниками для окружающих, помогая им осознать глубинные смыслы происходящего.

                     Однако склонность к самопожертвованию и чрезмерной ответственности может привести к эмоциональному выгоранию. Им важно развивать умение устанавливать личные границы, чтобы заботиться о себе так же, как они заботятся о других.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 12 Кодом отличаются мудростью, эмпатией и высокой чувствительностью к миру вокруг. Они обладают способностью глубоко анализировать происходящее и находить нестандартные решения. Их терпение и осознание ценности каждого момента помогают им принимать даже самые сложные ситуации с достоинством.

                     Однако они могут слишком много внимания уделять проблемам других, забывая о себе. Их чрезмерная самокритика и склонность к внутреннему диалогу иногда мешают им принимать простые и быстрые решения.

                     Для гармоничного развития им важно учиться балансировать между самопознанием и взаимодействием с миром. Это поможет им реализовать свои способности и чувствовать себя наполненными.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Учитесь ставить личные границы: Заботьтесь о себе, а не только о других.
                     - Развивайте уверенность: Доверьтесь своей интуиции и перестаньте сомневаться в себе.
                     - Не бойтесь просить о помощи: Позвольте другим быть для вас поддержкой.
                     - Балансируйте рефлексию и действие: Размышления важны, но помните о реальных шагах к цели.
                     - Практикуйте отдых: Найдите способы восстановления энергии, чтобы избежать выгорания.

                     Эти рекомендации помогут вам раскрыть потенциал и использовать свою мудрость для создания гармоничной и осмысленной жизни.
                     """
                 )
             ]
         ),
        // MARK: - 13 Код
         13: CodeInfo(
             codeNumber: 13,
             title: "1. Код Личности (13 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 13. Этот код символизирует перемены, трансформацию и способность к обновлению. Люди с этим Кодом обладают уникальной способностью адаптироваться к жизненным изменениям, переосмыслять свой путь и находить новые возможности там, где другие видят лишь препятствия.

                     В их жизни часто происходят значимые трансформации, которые помогают раскрыть их истинный потенциал. Они обладают глубокой внутренней силой, позволяющей им оставаться стойкими даже в сложных ситуациях. Их энергия направлена на развитие, поиск новых решений и духовный рост.

                     Однако, если они сопротивляются изменениям или боятся неопределённости, это может вызывать напряжение и внутренний конфликт. Им важно научиться доверять процессу жизни, принимая каждую трансформацию как шаг к личному и духовному росту.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 13 Кодом обладают сильной интуицией, глубокой восприимчивостью к изменениям и умением видеть суть вещей. Они стремятся к поиску смысла и могут проходить через сложные периоды жизни с осознанием их важности для личностного развития.

                     Их независимость и решительность помогают им преодолевать трудности, однако иногда они могут испытывать страх перед неизвестным. В такие моменты важно помнить, что изменения несут не только потери, но и возможности.

                     Научившись принимать перемены с доверием и осознанием, они могут использовать свою силу для создания новой, лучшей версии себя. Это позволяет им не только улучшить свою жизнь, но и вдохновлять окружающих на развитие.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Не бойтесь перемен: Они дают вам возможность выйти на новый уровень жизни.
                     - Развивайте осознанность: Анализируйте свои страхи и убеждения, чтобы видеть новые перспективы.
                     - Учитесь отпускать прошлое: Это необходимо для роста и движения вперёд.
                     - Работайте с интуицией: Доверяйте своему внутреннему голосу при принятии решений.
                     - Ставьте долгосрочные цели: Не бойтесь больших изменений, но двигайтесь к ним постепенно.

                     Эти рекомендации помогут вам адаптироваться к переменам, использовать их силу себе во благо и открывать новые горизонты в жизни.
                     """
                 )
             ]
         ),
        // MARK: - 14 Код
         14: CodeInfo(
             codeNumber: 14,
             title: "1. Код Личности (14 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 14. Этот код символизирует баланс, умеренность и стремление к гармонии. Люди с этим Кодом обладают способностью сочетать рациональность и интуицию, что помогает им принимать взвешенные решения. Они легко находят общий язык с разными людьми и умеют создавать атмосферу доверия и стабильности.

                     Их энергия направлена на поиск компромиссов, поддержание мира и создание устойчивых структур. Они обладают терпением и умением видеть перспективу, что делает их отличными стратегами и советниками.

                     Однако их стремление к балансу иногда может превращаться в чрезмерную осторожность. Им важно научиться действовать решительно, когда это необходимо, и не бояться выходить за пределы привычного комфорта.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 14 Кодом отличаются спокойствием, терпимостью и умением находить равновесие даже в самых непростых ситуациях. Они умеют работать с эмоциями, не поддаваясь импульсивным реакциям, что делает их надежными партнерами и коллегами.

                     Однако их стремление избегать конфликтов может привести к тому, что они будут подавлять свои желания ради общего спокойствия. Это может мешать им проявлять себя в полной мере и ограничивать их потенциал.

                     Развивая уверенность в своих решениях и способность выражать своё мнение, они смогут достичь гармонии между внутренними потребностями и внешними обстоятельствами.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Учитесь проявлять инициативу: Действуйте решительно, не боясь выходить за пределы привычного.
                     - Развивайте смелость: Иногда необходимо принимать смелые решения, даже если это кажется рискованным.
                     - Балансируйте между компромиссом и личными интересами: Не забывайте о своих желаниях и потребностях.
                     - Находите время для самовыражения: Развивайте творческий подход к жизни.
                     - Работайте с внутренней уверенностью: Учитесь доверять своим решениям и не сомневаться в себе.

                     Эти рекомендации помогут вам укрепить свою личность, развить уверенность и достичь гармонии в жизни.
                     """
                 )
             ]
         ),
        // MARK: - 15 Код
         15: CodeInfo(
             codeNumber: 15,
             title: "1. Код Личности (15 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 15. Этот код символизирует силу воли, магнетизм и умение управлять энергией. Люди с этим Кодом обладают яркой харизмой и способны оказывать сильное влияние на окружающих. Они наделены мощной внутренней энергией, которую могут направлять как на созидание, так и на разрушение.

                     Их природное обаяние и способность убеждать позволяют им легко находить общий язык с людьми. Они могут быть лидерами, новаторами и вдохновителями. Их внутренний огонь мотивирует их к достижению высших целей и преодолению любых препятствий.

                     Однако их сила может обернуться против них самих, если они не научатся контролировать свои желания. Им важно развивать осознанность и направлять свою энергию на позитивные цели, избегая чрезмерной зависимости от материального мира и внешних удовольствий.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 15 Кодом обладают сильным характером, амбициозностью и желанием контролировать свою судьбу. Они не боятся вызовов и готовы идти до конца, чтобы достичь своих целей. Их умение влиять на людей делает их успешными в социальных и профессиональных сферах.

                     Однако их страсть и стремление к власти могут привести к манипуляциям или чрезмерному фокусированию на личной выгоде. Они могут становиться зависимыми от одобрения окружающих или удовольствий, теряя внутренний баланс.

                     Развивая осознанность и контролируя свои импульсы, они могут раскрыть свой потенциал и достичь истинного успеха, основанного на гармонии и балансе.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Осознанно управляйте своей энергией: Направляйте её на созидательные и полезные цели.
                     - Контролируйте желания: Не позволяйте мгновенным удовольствиям управлять вашей жизнью.
                     - Развивайте духовный баланс: Практикуйте медитацию и самоанализ для укрепления внутренней гармонии.
                     - Используйте харизму с мудростью: Влияйте на людей позитивно, помогая им раскрыть свой потенциал.
                     - Работайте над дисциплиной: Ставьте перед собой долгосрочные цели и следуйте им, не отвлекаясь на кратковременные соблазны.

                     Эти рекомендации помогут вам раскрыть свой истинный потенциал и достичь гармонии между материальным и духовным аспектами жизни.
                     """
                 )
             ]
         ),
        // MARK: - 16 Код
         16: CodeInfo(
             codeNumber: 16,
             title: "1. Код Личности (16 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 16. Этот код символизирует разрушение старых основ, очищение и обновление. Люди с этим Кодом проходят через глубокие внутренние трансформации, которые помогают им избавиться от иллюзий и найти истинную опору в себе. Они обладают проницательностью и могут видеть скрытые процессы, происходящие в жизни.

                     Эти люди часто сталкиваются с неожиданными переменами, которые требуют от них гибкости и умения адаптироваться. Они способны выдерживать кризисные ситуации и выходить из них обновленными, становясь сильнее и мудрее. Их путь связан с разрушением ложных убеждений и поиском подлинных ценностей.

                     Однако стремление к радикальным изменениям может сделать их нетерпимыми к стабильности. Им важно развивать терпение и осознавать, что не все требует мгновенной трансформации. Принятие постепенного роста поможет им достичь внутреннего баланса.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 16 Кодом обладают аналитическим умом, глубоким внутренним миром и способностью распознавать истину. Они не боятся смотреть правде в глаза и готовы избавляться от всего, что мешает их развитию. Их жизненный путь связан с постоянным переосмыслением себя и окружающего мира.

                     Однако их критический взгляд на жизнь может приводить к разочарованиям и конфликтам с окружающими. Иногда им трудно принимать чужие точки зрения или мириться с несовершенством реальности. Это может вызывать у них чувство одиночества и изоляции.

                     Развивая терпимость и способность находить гармонию даже в несовершенных ситуациях, они могут легче проходить через жизненные испытания и укреплять свои социальные связи.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Принимайте перемены осознанно: Не все разрушения несут угрозу, иногда они освобождают место для лучшего.
                     - Находите баланс между анализом и доверием: Не всегда необходимо контролировать все аспекты жизни.
                     - Развивайте терпение: Позволяйте событиям разворачиваться естественным образом.
                     - Поддерживайте связи: Учитесь принимать поддержку от окружающих, а не полагаться только на себя.
                     - Работайте над внутренним покоем: Практики осознанности помогут вам справляться с изменениями без стресса.

                     Эти рекомендации помогут вам использовать вашу силу трансформации во благо и создавать устойчивые позитивные изменения в жизни.
                     """
                 )
             ]
         ),
        // MARK: - 17 Код
         17: CodeInfo(
             codeNumber: 17,
             title: "1. Код Личности (17 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 17. Этот код символизирует вдохновение, мечты и устремленность к высоким идеалам. Люди с этим кодом обладают особым внутренним светом, который помогает им находить надежду и верить в лучшее даже в сложных ситуациях. Их энергия направлена на созидание и поиск глубокого смысла.

                     Они обладают творческим мышлением и способны вдохновлять окружающих. Их природный оптимизм помогает им преодолевать любые трудности, а способность видеть возможности там, где другие видят преграды, делает их примером для других.

                     Однако склонность к идеализму может приводить к разочарованиям, если реальность не соответствует их ожиданиям. Им важно научиться сочетать высокие устремления с практическим подходом, чтобы их мечты становились реальностью.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 17 Кодом обладают мощной энергетикой, креативностью и стремлением к высоким идеалам. Они не боятся мечтать масштабно и вдохновлять других на новые свершения. Их внутренний свет притягивает к ним людей, ищущих вдохновения и поддержки.

                     Однако их стремление к идеалу может иногда мешать им видеть реальную картину. Они могут быть склонны игнорировать мелкие, но важные детали, что затрудняет реализацию их идей. Также они могут разочаровываться, если сталкиваются с медленными результатами.

                     Развивая практичность и умение разбивать большие цели на этапы, они смогут воплощать свои мечты в жизнь и сохранять гармонию в отношениях с окружающими.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Развивайте реализм: Учитесь видеть не только конечную цель, но и шаги к ее достижению.
                     - Практикуйте терпение: Дайте себе время на реализацию своих идей.
                     - Заботьтесь о себе: Поддерживайте баланс между вдохновением и реальным действием.
                     - Укрепляйте связи: Окружайте себя людьми, которые поддерживают вас и помогают воплощать мечты.
                     - Используйте свой талант: Направляйте свою энергию на создание чего-то значимого и долговечного.

                     Эти советы помогут вам реализовывать ваши идеи и сохранять гармонию во всех сферах жизни.
                     """
                 )
             ]
         ),
        // MARK: - 18 Код
         18: CodeInfo(
             codeNumber: 18,
             title: "1. Код Личности (18 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 18. Этот код символизирует интуицию, эмоциональную глубину и тайные знания. Люди с этим кодом обладают развитым восприятием и чувствительностью, что позволяет им видеть скрытые аспекты реальности. Они умеют разгадывать сложные жизненные загадки и понимать внутренние мотивы других людей.

                     Их природная эмпатия делает их прекрасными советчиками и проводниками для тех, кто ищет истину. Они способны чувствовать тонкие энергии, предугадывать события и находить ответы в своём подсознании.

                     Однако склонность к излишнему самоанализу и переживаниям может приводить к тревожности. Им важно научиться доверять своей интуиции и управлять эмоциями, чтобы не теряться в собственных переживаниях.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 18 Кодом отличаются глубокой эмоциональностью, чуткостью и развитым воображением. Они умеют считывать эмоции окружающих, что делает их внимательными и отзывчивыми. Их способность анализировать происходящее помогает им видеть скрытые мотивы людей.

                     Однако их чувствительность может стать причиной внутренней неуверенности и страхов. Иногда они могут замыкаться в себе, опасаясь осуждения или разочарования. Склонность к самоанализу иногда мешает им действовать уверенно.

                     Развивая внутреннюю устойчивость и способность фокусироваться на позитивных аспектах жизни, они смогут использовать свою интуицию и эмоциональную глубину для личного роста и успешных взаимодействий с окружающими.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Доверяйте своим ощущениям: Развивайте интуицию и используйте её как инструмент принятия решений.
                     - Контролируйте эмоции: Практикуйте техники осознанности и релаксации.
                     - Открывайтесь миру: Не бойтесь выражать свои мысли и чувства окружающим.
                     - Избегайте изоляции: Поддерживайте социальные связи и находите вдохновение в общении.
                     - Ставьте чёткие цели: Определяйте направления для личного роста и следуйте им.

                     Эти рекомендации помогут вам укрепить уверенность в себе, преодолеть страхи и раскрыть свой потенциал в полной мере.
                     """
                 )
             ]
         ),
        // MARK: - 19 Код
         19: CodeInfo(
             codeNumber: 19,
             title: "1. Код Личности (19 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 19. Этот код символизирует внутренний свет, радость и успех. Люди с этим кодом обладают харизмой, яркостью и умением вдохновлять других. Они привлекают к себе людей своим оптимизмом, уверенностью и способностью находить выход из любых ситуаций.

                     Их жизненная энергия и позитивный настрой делают их естественными лидерами. Они легко находят общий язык с окружающими и могут быть источником радости и вдохновения. Они стремятся к самореализации и достижению высоких целей, всегда находясь в поиске новых возможностей.

                     Однако чрезмерное стремление к успеху и признанию может приводить к выгоранию. Им важно помнить о необходимости заботиться о своём эмоциональном состоянии и находить баланс между активной деятельностью и отдыхом.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 19 Кодом обладают мощной энергетикой, позитивным мышлением и естественной способностью вдохновлять. Они уверены в себе, умеют привлекать внимание и обладают сильным стремлением к достижению успеха.

                     Их лидерские качества и харизма помогают им находить сторонников и единомышленников. Они часто становятся центром внимания в любых компаниях, так как их оптимизм и открытость делают их притягательными для окружающих.

                     Однако чрезмерное желание быть на вершине может привести к эмоциональному истощению. Им важно учиться отдыхать, не бояться показывать слабость и принимать поддержку от близких.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Учитесь отдыхать: Регулярно находите время для восстановления сил и расслабления.
                     - Поддерживайте баланс: Не забывайте о гармонии между работой и личной жизнью.
                     - Уделяйте внимание отношениям: Развивайте доверительные связи и учитесь принимать поддержку.
                     - Будьте осознанными: Практикуйте моменты тишины и размышлений, чтобы лучше понимать себя.
                     - Развивайте щедрость: Делитесь своим светом с другими, не ожидая признания.

                     Эти советы помогут вам использовать вашу мощную энергетику с максимальной пользой и избежать эмоционального истощения, сохраняя внутреннюю гармонию.
                     """
                 )
             ]
         ),
        // MARK: - 20 Код
         20: CodeInfo(
             codeNumber: 20,
             title: "1. Код Личности (20 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 20. Этот код символизирует осознание, пробуждение и внутреннюю трансформацию. Люди с этим кодом обладают способностью к глубокому самопознанию и часто переживают периоды переосмысления своей жизни. Они стремятся к пониманию своей истинной природы и часто помогают другим обрести смысл и направление.

                     Эти люди обладают развитой интуицией и способностью замечать скрытые детали. Они могут легко анализировать прошлый опыт и извлекать из него ценные уроки. Их стремление к духовному росту делает их проводниками изменений и вдохновения.

                     Однако склонность к постоянному анализу может привести к излишнему самокопанию и сомнениям. Им важно научиться отпускать прошлое и жить настоящим моментом, чтобы сохранять внутреннюю гармонию.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 20 Кодом обладают глубоким восприятием жизни и стремлением к самосовершенствованию. Они видят взаимосвязь событий и способны находить смысл даже в сложных ситуациях. Их способность к анализу делает их мудрыми советчиками, способными направлять других.

                     Однако их склонность к размышлениям о прошлом может мешать им сосредоточиться на настоящем. Они могут быть слишком самокритичными и иногда испытывать вину за принятые ранее решения.

                     Им важно учиться доверять своему пути, принимать ошибки как часть опыта и не зацикливаться на прошлом. Это поможет им находить радость в настоящем и уверенно двигаться вперед.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Научитесь прощать: Освобождайтесь от груза прошлого и принимайте себя без осуждения.
                     - Живите в настоящем: Фокусируйтесь на том, что реально и доступно здесь и сейчас.
                     - Используйте свою интуицию: Доверяйте своим ощущениям и внутреннему голосу.
                     - Развивайте уверенность: Верьте в свои решения и не сомневайтесь в своём пути.
                     - Практикуйте благодарность: Оценивайте каждый день как новый шанс для роста.

                     Следуя этим рекомендациям, вы сможете найти баланс между самопознанием и активной жизнью, используя свою осознанность для достижения гармонии и успеха.
                     """
                 )
             ]
         ),
        // MARK: - 21 Код
         21: CodeInfo(
             codeNumber: 21,
             title: "1. Код Личности (21 Код)",
             subcategories: [
                 Subcategory(
                     title: "Значение кода",
                     shortDescription: "Ваши ключевые характеристики и особенности личности.",
                     mainDescription: """
                     Ваш Код Личности — 21. Этот код символизирует завершённость, целостность и внутренний покой. Люди с этим кодом обладают способностью видеть жизнь как гармоничную систему, где всё взаимосвязано. Они легко достигают успеха, так как умеют сочетать интуицию и разум, находя правильные решения даже в сложных ситуациях.

                     Эти люди излучают уверенность, спокойствие и стабильность. Их присутствие создаёт ощущение порядка и гармонии. Они способны вдохновлять окружающих своим примером, показывая, как можно достигать поставленных целей, не теряя внутреннего равновесия.

                     Однако их стремление к совершенству может иногда приводить к завышенным ожиданиям и разочарованиям, если что-то идёт не так, как они планировали. Им важно научиться принимать несовершенства и ценить процесс так же, как и результат.
                     """
                 ),
                 Subcategory(
                     title: "Влияние на характер",
                     shortDescription: "Как заложенные качества формируют поведение.",
                     mainDescription: """
                     Люди с 21 Кодом отличаются зрелостью, ответственностью и способностью сохранять ясность мышления в любых ситуациях. Они обладают природной мудростью и стратегическим мышлением, что помогает им добиваться успеха в разных сферах жизни.

                     Однако их стремление к контролю и идеалу может мешать им наслаждаться текущим моментом. Они могут быть склонны к перфекционизму и излишнему самоконтролю, что вызывает внутреннее напряжение.

                     Им важно учиться отпускать ситуацию, развивать гибкость и принимать неожиданные повороты судьбы как часть естественного хода вещей. Это поможет им сохранять гармонию и находить радость даже в мелочах.
                     """
                 ),
                 Subcategory(
                     title: "Рекомендации",
                     shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                     mainDescription: """
                     - Развивайте гибкость: Учитесь принимать изменения без излишнего напряжения.
                     - Освобождайтесь от перфекционизма: Помните, что важен процесс, а не только результат.
                     - Поддерживайте баланс: Чередуйте работу и отдых, уделяя внимание эмоциональному благополучию.
                     - Доверяйте жизни: Позвольте событиям развиваться естественным образом.
                     - Делитесь опытом: Используйте свою мудрость для поддержки и вдохновения других.

                     Эти рекомендации помогут вам сохранять внутреннюю гармонию, наслаждаться жизнью и использовать свою энергию для достижения больших целей.
                     """
                 )
             ]
         ),
        22: CodeInfo(
            codeNumber: 22,
            title: "1. Код Личности (22 Код)",
            subcategories: [
                Subcategory(
                    title: "Значение кода",
                    shortDescription: "Ваши ключевые характеристики и особенности личности.",
                    mainDescription: """
                    Ваш Код Личности — 22. Этот код символизирует свободу, спонтанность и открытость новым возможностям. Люди с этим кодом обладают яркой харизмой, нестандартным мышлением и способностью легко адаптироваться к изменениям. Они интуитивно чувствуют направление, в котором нужно двигаться, и часто выбирают путь, полный неожиданных возможностей.

                    Эти люди склонны жить в потоке, доверяя своей интуиции и не привязываясь к жёстким планам. Они обладают природным талантом видеть перспективы там, где другие видят хаос. Их лёгкость, жизнерадостность и гибкость помогают им преодолевать препятствия и находить нестандартные решения.

                    Однако их стремление к спонтанности иногда приводит к отсутствию структуры в жизни. Им важно развивать баланс между свободой и ответственностью, чтобы их энергия не рассеивалась, а приносила конкретные результаты.
                    """
                ),
                Subcategory(
                    title: "Влияние на характер",
                    shortDescription: "Как заложенные качества формируют поведение.",
                    mainDescription: """
                    Люди с 22 Кодом отличаются креативностью, независимостью и гибкостью. Они легко находят общий язык с людьми, умеют вдохновлять и привлекать к себе внимание. Их нестандартный взгляд на мир позволяет им выходить за рамки привычного и находить уникальные возможности.

                    Однако их любовь к спонтанности может приводить к недисциплинированности и несистемному подходу. Они могут избегать ответственности или откладывать важные решения, что мешает им достигать долгосрочных целей.

                    Им важно учиться совмещать свою свободу с умением организовывать процессы. Это поможет им не только реализовывать свои идеи, но и выстраивать стабильное будущее.
                    """
                ),
                Subcategory(
                    title: "Рекомендации",
                    shortDescription: "Как использовать свои сильные стороны и работать с ограничениями.",
                    mainDescription: """
                    - Развивайте стратегическое мышление: Учитесь планировать шаги к своим целям, сохраняя гибкость.
                    - Поддерживайте дисциплину: Найдите баланс между свободой и ответственностью.
                    - Доверяйте своей интуиции: Ваша способность чувствовать правильный момент — ваш главный ресурс.
                    - Работайте над концентрацией: Фокусируйтесь на важных задачах, не распыляя энергию.
                    - Используйте свою харизму: Делитесь своими идеями и вдохновляйте окружающих.

                    Эти рекомендации помогут вам сохранять свою уникальность, при этом выстраивая гармоничную и успешную жизнь.
                    """
                )
            ]
        ),
    ]
}
